<?php

namespace App\Enums;

enum ThemeType: int
{
    /**
     * Середовище або місце дії
     */
    case SETTING = 1;

    /**
     * Специфічний елемент контенту (Меха, Супер сили, Гарем)
     */
    case ELEMENT = 2;

    /**
     * Демографічна група (Дорослі персонажі)
     */
    case DEMOGRAPHIC = 3;

    /**
     * Тематичний фокус контенту (Психологічний, Виживання)
     */
    case THEME = 4;

    /**
     * Невизначений або загальний тип, який не підходить до інших категорій
     */
    case NON_CLASSIFIED = 5;
}
